// Даны три целых числа.
// Найдите наибольшее из них (программа должна
// вывести ровно одно целое число).
// Под наибольшим в этой задаче понимается число,
// которое не меньше, чем любое другое.
// Формат входных данных
// Вводятся три числа.
// Формат выходных данных
// Выведите ответ на задачу.

#include <iostream>

using namespace std;

int main() {
    int a = 0;
    int b = 0;
    int c = 0;
    cin >> a >> b >> c;
    if (a <= b) {
        a = b;
    }
    if (c >= b) {
        cout << c << endl;
    } else {
        cout << b << endl;
    }
    system("pause");
    return 0;
}